
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/tentuku10/aws-ecs-terraform/actions/runs/4518491319)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0312363f840ed32db]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063f1b3398ef3436e]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0278fc0070a502a87]
aws_security_group.ecs: Refreshing state... [id=sg-0bbafcedff85edc6f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0307139f37e6298a4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02846bfbfc65dfced]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e3c37a3581b6687d]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:targetgroup/go-app-target-group/721e8662c3cc56d0]
aws_security_group.alb: Refreshing state... [id=sg-055b6e15e06b167b9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05bcf52febed18f77]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033690c6548d62613]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d51ee8b7132b0410]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f062c3f08f6c956d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0af9cf614a51dcacc]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1809363762]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02846bfbfc65dfced1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b2a6d187f62a1ecb]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:loadbalancer/app/go-app-alb/7d090edf7111de88]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f562c8585bb5a0cc]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03952cd353f2e41f7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-013217273682e9add]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-030c658c088747c74]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-004be7179a24dcc16]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0307139f37e6298a41080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033690c6548d626131080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:listener/app/go-app-alb/7d090edf7111de88/6b32ffc2b370331a]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:listener-rule/app/go-app-alb/7d090edf7111de88/6b32ffc2b370331a/36d25c4bfc8945e0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-app"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-app]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-app]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"ddd24384923ab050c5e2f2d23bc44ecdee85a1ea","Vars":{},"WorkflowName":"Terraform"} -->